# 0) ჩამოწერეთ და ახსენით რას შვება დღეს ახსნილი 2 სტრინგის ფუნქცია

# 1) დაწერეთ რამდენი არგუმენტის მიღება შეუძლია range() და განიხილეთ ყველა

# 2) დაწერეთ შეიძლება თუ არა რომ for loopით გადავუაროთ listებს და stringებს? თუ კი მაშინ როგორ?
 
# 3) შექმენით სია, შემდეგ ამ სიას გადაუარეთ for loopით და სხვა სიაში ჩაამატეთ
# მხოლოდ ისეთი ელემენტები რომლებიც იწყება 'ა'ზე

# 4) მომხმარებელს შემოატანინეთ სახელი, შემდეგ ამ სახელს გადაუარეთ for loopით და ყველა ასო
# დიდ ასოებად გადააქციეთ(თავიდანვე .upper არ გამოიყენოთ)





#0)
name = "example"

# .isupper() - ფუნქცია ამოწმებს არის თუ არა სტრინგი დაწერილი დიდი შრიფტით
print(name.isupper())   #ამ შემთხვევაში გამოიტანს False-ს, რადგან დიდი შრიფტით არაა დაწერილი

# .islower() - ეს კი იმას ამოწმებს, არის თუ არა სტრინგი პატარა შრიფტით დაწერილი
print(name.islower())   #ამ შემთხვევაში გამოიტანს True-ს, რადგან პატარა შრიფტითაა დაწერილი



#1)

# range() ფუნქციამ შეიძლება მიიღოს სულ 3 არგუმენტი

# როცა 1 არგუმენტს იღებს, მაშინ იტერაცია გაგრძელდება 0-დან ამ არგუმენტამდე
for i in range(5):
    print(i)  #გამოიტანს 0,1,2,3,4

# როცა 2 არგუმენტს იღებს, მაშინ იტერაცია გაგრძელდება პირველი არგუმენტიდან მეორე არგუმენტის მნიშვნელობამდე
for i in range(2, 5):
    print(i)  #გამოიტანს 2,3,4

# 3 არგუმენტის მიღებისას ათვლა დაიწყება პირველი არგუმენტიდან მეორე არგუმენტის მნიშვნელობამდე, მესამე არგუმენტი კი განსაზღვრავს
# "ნაბიჯის" ზომას, ანუ ყოველ იმდენ ელემენტს გამოოტანს რამდენიც მესამე არგუმენტშია, ამას ჰქვია stepping
for i in range(1, 10, 2):
    print(i)  #გამოიტანს 1,3,5,7,9



#2)
# for loop-ით შეგვიძლია list-ებსა და string-ებს გადავუაროთ

# list-ის მაგალითი:
list = [1, 2, 3, 4, 5]
for i in list:
    print(i)  #გამოიტანს 1,2,3,4,5-ს თითოეულ ახალ ხაზზე

# string-ის:
string = "hello"
for i in string:
    print(i)  #გამოიტანს h,e,l,l,o - ს ახალ ხაზზე



#3)
list = ['Apple', "apricot", 'Banana', 'Orange', 'avocado']
a_list = []
for i in list:
    if i[0] == 'a' or i[0] == 'A':
        a_list.append(i)
print(a_list)



#4)
name1 = ""
name = input("Enter Name: ")
for i in name:
    name1 += i.upper()
print(name1)