# 0)კომენტარების დახმარებით ჩამოწერეთ და ახსენით დღეს ნასწავლი List ფუნქციები
# 1)შექმენით რიცხვების სია [1, 2, 3, 4, 5] და დაპრინტეთ შებრუნებული
# 2)შექმენით სია, შემდეგ ამოაგდეთ ბოლო ელემენტი და ჩაამატეთ ახალი ელემენტი
# 3)შექმენით სია, თუ ამ სიის სიგრძე მეტი იქნება 4ზე, მაშინ ამ სიაში ჩაამატეთ ახალი მნიშვნელობა, ხოლო თუ ამ სიის სიგრძე ნაკლენი იქნება 4ზე, მაშინ ამ სიას ამოაკელით ელემენტი, საბოლოოდ კი დაპრინტეთ სია
# 4)შექმენით სია fruits, შემდეგ მომხმარებელს შემოატანინეთ რაიმე ხილი, თუ ეს ხილი იქნება ამ სიაში მაშინ ამოაკელით, ხოლო თუ ეს ხილი არ იქნება ამ სიაში მაშინ ჩაამატეთ


#0)
#1. append() - ამატებს გადაცემულ ელემენტს სიის ბოლოს
#2. pop() - შლის გადაცემულ ინდექსზე არსებულ ელემენტს
#3. len() - გამოიტანს გადაცემული ელემენტის სიგრძეს, ზომას

#1)
my_list = [1, 2, 3, 4, 5]
print(my_list[::-1])

#2)
my_list = [1, 2, 3, 4, 5]
my_list.pop(-1)
my_list.append(6)
print(my_list)

#3)
my_list = [1, 2, 3, 4, 5]

if len(my_list) > 4:
    my_list.append(6)
elif len(my_list) < 4:
    my_list.pop()
print(my_list)

#4)
fruits = ["apple", "banana", "cherry"]
user_fruit = input("Enter a fruit: ")
if user_fruit in fruits:
    fruits.remove(user_fruit) #remove() - ამ ფუნქციის საშვალებით შეგვიძლია სიიდან ამოვიღოთ კონკრეტული ელემენტი, რომელსაც "()" ფრჩხილებში მივუთითებთ
else:
    fruits.append(user_fruit)
print(fruits)