#0)კომენტარების სახით ახსენით control flowს სამივე ტექნიკა დაწვრილებით
#1)კომენტარების სახით ახსენით როგორ მუშაობს For ციკლი
#2)For ციკლის მეშვეობით ტერმინალში გამოიტანეთ რიცხვები 1-1000ის ჩათვლით
#3)For ციკლის მეშვეობით ტერმინალში გამოიტანეთ თქვენი საყვარელი საჭმელი 15ჯერ
#4)For ციკლის მეშვეობით ტერმინალში გამოიტანეთ 5-5ჯერ თქვენი ოჯახის წევრების სახელები

#0)control flow ტექნიკები
#sequencion- ბრძანებები შესრულდება ზუსტად იმ თნმიმდევრობით, როგორც დაწერილია.
#iteration- სრულდება loop ანუ ციკლი, სანამ არ შეასრულდება გარკვეული პირობა.
#selection- არჩევნის გაკეთება ხდება გარკვეული პირობის მიხედვით.

#1)For ციკლი
#for ციკლი საშუალებას გვაძლევს გავიმეოროთ კონკრეტული ბრძანებები განსაზღვრული რაოდენობით.

#2)
for i in range(1, 1001):
    print(i)

#3)
for i in range(15):
    print("ხინკალი")

#4)
for i in range(5):
    print("დედა")

for i in range(5):
    print("მამა")

for i in range(5):
    print("ძმა")
    
for i in range(5):
    print("ბიძაშვილი")