# 1) ახსენით რას აკეთებს try/except და რისთვის ვიყენებთ მას

# 2) ახსენით რას აკეთებს finally

# 3) შექმენით პროგრამა რომელიც მომხმარებელს შემოატანინებს რიცხვების სიას. სცადეთ ყველა ელემენტის int-ად გადაქცევა. 
# თუ რომელიმე ელემენტი რიცხვი არ არის გამოიყენეთ try/except და დაბეჭდეთ "სიაში არასწორი მონაცემია".

# 4) შექმენით პროგრამა სადაც არის სია. მომხმარებელს შემოატანინეთ ინდექსი და სცადეთ ელემენტის წაშლა (pop). 
# თუ ინდექსი არ არსებობს გამოიყენეთ try/except და დაბეჭდეთ "ინდექსი არ არსებობს".

# 5) შექმენით პროგრამა რომელიც მომხმარებელს შემოატანინებს რიცხვს. თუ მომხმარებელმა შემოიტანა სტრინგი მაშინ დაბეჭდეთ "არასწორი ასაკი"




# 1)
# try/except - ერთერთი მეთოდი რომელიც გამოიყენება იმისთვის რომ თავიდან ავიცილოთ პროგრამის გაჩერება თუ მაგ. მომხმარებელმა არასწორი მონაცემი შეიყვანა 
# try ბლოკში ვწერთ კოდს რომელიც გვინდა რომ გაეშვას თავდაპირველად და შეიძლება გამოიწვიოს შეცდომა, 
# ხოლო except ბლოკში ვწერთ კოდს რომელიც შესრულდება იმ შემთხვევაში თუ try ბლოკში შეცდომა მოხდა.


# 2)
# finally - ბლოკი რომელიც ყოველთვის შესრულდება, მიუხედავად მიუხედავად იმისა, მოხდება თუარა შეცდომა try ბლოკში


# 3)
def list_int(li):
    try:
        return [int(i) for i in li]
    except ValueError:
        return "სიაში არასწორი მონაცემია"
# test
print(list_int([25,41.6,"68"]))
print(list_int([25,41.6,"68",True,"string"]))


# 4)
def list_pop(lis, index):
    try:
        lis.pop(index)
        return lis
    except IndexError:
        return "ინდექსი არ არსებობს"
# test
print(list_pop([67,68,69], 2))
print(list_pop([67,68,69], 5))


# 5)
age = input("Enter Your Age: ")
try:
    age == int(age)
    print(f"შენ ხარ {age} წლის!..")
except ValueError:
    print("არასწორი ასაკი")