#0) დაწერეთ, რა შემთხვევაში შეგვიძლია მნიშვნელობის გადაქცევა ინტეჯერად და ფლოათათ
#1) მომხმარებელს შემოატანინეთ 2 რიცხვი inputით(აუცილებლად გადააქციეთ ინტეჯერად), შემდეგ პრინტის მეშვეობით ამ ორ რიცხვზე გამოიყენეთ ყველა მათემატიკური ოპერაცია


print("integer-ად შეგვიძლია გადავაქციოთ ნებისმიერი მთელი რიცხვი სტრინგში")
print("float-ად შეგვიძლია გადავაქციოთ ნებისმიერი რიცხვი სტრინგში")

a = int(input("შეიყვანეთ პირველი რიცხვი: "))
b = int(input("შეიყვანეთ მეორე რიცხვი: "))
print("ამ ორი რიცხვის ჯამი არის: ", int(a + b))
print("ამ ორი რიცხვის სხვაობა არის: ", int(a - b))
print("ამ ორი რიცხვის ნამრავლი არის: ", int(a * b))
print("ამ ორი რიცხვის განაყოფი არის: ", (a // b))
print("ამ ორი რიცხვის განაყოფი არის: ", (a / b))
