//  #Classwork
// 1) მოიძიეთ ინფორმაცია Ternary Operatorზე

// 2) ახსენით რა განსხვავებაა ტერნარი ოპერატორსა და ჩვეულებრივ ifelse შორის 

// 3) Ternary Operator დახმარებით შეამოწმეთ userAge არის თუ არა სრულწლოვანი


// 1) Ternary Operator არის if-else სტრუქტურის მოკლე და გამარტივებული ფორმა,
// საშუალებას გვაძლევს ერთ ხაზში დავწეროთ პირობა.
// ხშირად გამოიყენება მარტივი პირობების შესამოწმებლად და კოდის წაკითხვის გასამარტივებლად

// 2) ორივე გამოიყენება პირობის შემოწმებისთვის, მაგრამ ტერნარი ოპერატორის სტრუქტურა უფრო პატარა და კომპაქტურია, 
// ხშირად შეგვიძლია გამოვიყენოთ მარტივი პირობების შესამოწმებლად. 
// if-else სტრუქტურა უფრო ვრცელია, და ლოგიკის გაგება შეიძლება უფრო მარტივი იყოს, შედარებით რთული პირობების შესამოწმებლად გამოიყენება.

// 3)
let userAge = 26;
userAge >= 18 ? console.log("User is an adult"): console.log("User is not an adult");

