// https://felixgerschau.com/javascript-memory-management/
// 1) გადახედეთ ამ გვერდს და ამიხსენით რა არის stack და heap

// stack - სტრუქტურა, რომელშიც ინახება პრიმიტიული ტიპის ცვლადები (number, boolean,string აშ.) და ასევე კომპლექსური ტიპის ცვლადები,
// რომლებიც მიუთითებენ ჰიპში არსებულ ობიექტებზე.
// stack-ს აქვს გარკვეული ზომა რომლის გადაჭარბებისას ხდება stack overflow, რის დროსაც პროგრამა ვეღარ მუშაობს.

// reference  - კომპლექსური ტიპის ცვლადები, რომლებიც მიუთითებენ heap-ში არსებულ ობიექტებზე.

// heap - აქ ინახება ობიექტები, ფუნქციები, მასივები. 
// ზომა: ჰიპს არ აქვს წინასწარ განსაზღვრული ზომა.
// stack-ში შენახული კომპლექსური ტიპის ცვლადები მიუთითებენ ჰიპში არსებულ ობიექტებზე, 
// მაგალითად ფუნქციის შემთხვევაში, stack-ში ინახება ფუნქციის სახელი და მისამართი(heap-ში), ხოლო heap-ში ინახება ფუნქციის კოდი, მისი body(ტანი).


// # Homework

// 1) for ციკლის საშუალებით 1 დან 20 ის ჩათვლით გამოიტანეთ მხოლოდ ლუწი რიცხვები

// 2) for ციკლის საშუალებით გადაუარეთ მასივს და შეამოწმეთ და გამოიტანეთ მხოლოდ ის რომლის სიგრძე იქნება 5

// 1)

for(let i = 0; i  < 21; i++){
    if(i % 2 === 0){
        console.log(i)
    }
}

// 2)

const ar = ["vaja",  "nino", "gabrieli", "anano", "luka", "giorgi", "sandro"]
for(let i = 0; i < ar.length; i++){
    if(ar[i].length === 5){
        console.log(ar[i])
    }
}




