# 1) ახსენით რას აკეთებენ map და filter და რა განსხვავებაა მათ შორის
# 2) გაფილტრეთ numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9] სია და შეინახეთ მხოლოდ კენტი რიცხვები 
# 3) map-ით გადაუარეთ numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9] სიას და გამოიტანეთ ყველა რიცხვის კვადრატი


# 1)
# map - გავლენას ახდენს ლისთის თითიოეულ წევრზე და ცვლის მათ ჩვენ მიერ გადაცემული ფუნქციის მიხედვით
# გადაეცემა ფუნქცია და საიტერაციო ცვლადი, აბრუნებს იგივე სიგრძის სიას
# filter - ფილტრავს სიას ჩვენ მიერ გადაცემული პირობის მიხედვით
# გადაეცემა ფუნქცია და საიტერაციო ცვლადი, ძირითადად აბრუნებს უფრო მოკლე სიგრძის სიას

# 2)
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
nums = list(filter(lambda x: x%2==1, numbers))
print(nums)

# 3)
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
double = list(map(lambda x: x**2,numbers))
print(double)





# 4) შექმენით სახელების სია და filter-ით შეინახეთ მხოლოდ ის სახელები რომლებიც იწყება ა ასოთი

# 4)
user_names = ["leqso","demetre","gio","andria","nika","vaja","anano"]
filtered_names=list(filter(lambda y: y.lower()[0]=="a", user_names))
print(filtered_names)



