# 0) კომენტარებით ახსენით რა არის default value
# 1) შექმენით ფუნქცია, რომელსაც გადაეცემა 2 რიცხვი, პირველ რიცხვს ჰქონდეს default value 3, ხოლო მეორეს 5.
# ფუნქციამ უნდა გამოიტანოს ამ ორი რიცხვიდან უდიდესი რიცხვი

#0) default value არის მნიშვნელობა რომელიც პარამეტრს ავტომატურად იღებს მაშინ,
# როცა ფუნქციის გამოძახებისას მას არ გადაეცემა არგუმენტი



def max(a=3, b=5):
    if a > b:
        return a
    else:
        return b
# print(max())


def max_num(a=3, b=5):
    return max(a, b)

print(max_num())