// # Classwork

// 1. კომენტარებით ახსენით რას შვება .forEach, .filter, .map, .some, ასევე კომენტარებით ახსენით რას ნიშნავს high order functions

// 2. .forEach

// მოცემულობა: გაქვს სახელების მასივი: ['ანა', 'ნიკა', 'გიორგი'].

// მიზანი: forEach-ის გამოყენებით, კონსოლში გამოიტანე თითოეული სახელი მისალმებასთან ერთად.

// 3. .map 

// მოცემულობა: გაქვს მასივი: [2, 4, 6, 8].

// მიზანი: map-ის გამოყენებით შექმენი ახალი მასივი, სადაც თითოეული რიცხვი გამრავლებული იქნება 2-ზე.

// 4. .filter 

// მოცემულობა: გაქვს ასაკების მასივი: [12, 25, 17, 30, 15].

// მიზანი: filter-ის გამოყენებით შექმენი ახალი მასივი, რომელშიც მხოლოდ 18 წლის ან უფროსი ასაკის რიცხვები მოხვდება.

// 5. .some

// მოცემულობა: გაქვს მასივი: [5, 8, -2, 10].

// მიზანი: some-ის გამოყენებით გაარკვიე, არის თუ არა მასივში თუნდაც ერთი უარყოფითი (0-ზე ნაკლები) რიცხვი.





/*
1.
High Order Functions:
ესენია ფუნქციები, რომლებიც არგუმენტად იღებენ სხვა ფუნქციას ან აბრუნებენ მას. 
ანუ გამოიყენება helper და main ფუნქციები, აქ მთავარ მნიშვნელობას main ფუნქცია აბრუნებს, მას კი ამ ყველაფერში დამხმარე(helper) ფუნქცია ეხმარება.

.forEach - გამოიყენება ელემენტების სათითაოდ გადასავლელად (იტერაციისთვის).

.map - ქმნის ახალ მასივს, სადაც თითოეული ელემენტი არის შეცვლილი.

.filter - ქმნის ახალ მასივს, სადაც მხოლოდ პირობის შესაბამისი ელემენტები რჩება, ანუ ახალი გაფილტრული მასივი იქმნება.

.some - აბრუნებს true-ს, თუ მასივში თუნდაც ერთი ელემენტი აკმაყოფილებს რაიმე პირობას.

*/


// 2.
const names = ['ანა', 'ნიკა', 'გიორგი'];
names.forEach((name) => {
    console.log(`გაგიმარჯოს ${name}`);
});


// 3.
const numbers = [2, 4, 6, 8];
const doubled = numbers.map((num) => {
    return num * 2;
});
console.log(doubled);


// 4.
const ages = [12, 25, 17, 30, 15];
const adults = ages.filter((age) => {
    return age >= 18;
});
console.log(adults);


// 5. .some
const mixedNumbers = [5, 8, -2, 10];
const hasNegative = mixedNumbers.some((num) => {
    return num < 0;
});
console.log(hasNegative);


