# 0) კომენტარებით ჩამოწერეთ ყველა ნასწავლი ლისტის ფუნქცია(ძველიც და ახალიც) და მიუწერეთ ახსნა
# 1) შექმენით რიცხვების სია, ბოლოში ჩაამატეთ ახალი რიცხვი და ამოაკელით პირველი რიცხვი, შემდეგ კი დაალაგეთ კლებადობის მიხედვით



# 0)
# .sort() - საშუალებას გვაძლევს ლისტის ელემენტების დალაგებას ზრდადობის ან კლებადობის მიხედვით(რიცხვების შემთხვევაში),
# ტექსტების შემთხვევაში კი დაიწყება A,B,C... ანუ ზრდადობით ალაგებს ელემენტებს

# .clear() - ამ ფუნქციის საშუალებით შეგვიძლია ლისტის ყველა ელემენტის წაშლა

# .reverse() - საშუალებას გვაძლევს შემოვაბრუნოთ ლისტის ელემენტები

# .index() - ამ ფუნქციის საშუალებით შეგვიძლია გავიგოთ კონკრეტული ელემენტის ინდექსი ლისტში

# .insert() - ამ ფუნქციის საშუალებით შეგვიძლია ლისტში კონკრეტულ ინდექსზე ჩავამატოთ ელემენტი

# .remove() - ამ ფუნქციის საშუალებით შეგვიძლია სიიდან ამოვიღოთ კონკრეტული ელემენტი, რომელსაც "()" ფრჩხილებში მივუთითებთ



# 1)
my_list = [5, 3, 7, 1, 4, 2, 6]
my_list.append(8)
my_list.pop(0)
my_list.sort()
my_list.reverse()
print(my_list)