# 0)ახსენით როგორ მუშაობს სლაისინგი
# 1)შექმენით სია სადაც შეინახავთ მანქანებს და გამოიტანეთ 3დან 5ის ჩათვლით ყველა მანქანა
# 2)მომხმარებელს შემოატანინეთ სახელი და შემდეგ დაპრინტეთ პირველი და ბოლო ასოს გარეშე
# 3)მომხმარებელს შემოატანინეთ სახელი და ასევე შექმენით სია, შემდეგ გამოიტანეთ სახელის მეორე ნახევარი და სიის პირველი ნახევარი

# Hard Level

# 4)მომხმარებელს შემოატანინეთ სახელი, შემდეგ თუ ეს სახელი იწყება "რ"-ზე, მაშინ დაპრინტეთ "Hello",
# ხოლოსხვა შემთხვევაში დაპრინტეთ "Bye" (დაგჭირდებათ სლაისინგი და if/else)



#0) სლაისინგი საშუალებას გვაძლევს სტრინგის ან ლისტის ნაწილი, ნაწილები გამოვიტანოთ ინდექსების მიხედვით.

#1)
cars = ["Toyota", "Honda", "BMW", "Audi", "Mercedes", "Ford", "Dodge"]
print(cars[2:5])

#2)
name = input("შეიყვანეთ თქვენი სახელი: ")
print(name[1:-1])

#3)
name = input("შეიყვანეთ თქვენი სახელი: ")
list = ["ლექსო", "ბექა", "გიორგი", "ნიკა", "თორნიკე", "მარიამი", "გაბრიელი"]

half_name = name[len(name)//2:]
half_list = list[:len(list)//2]
print(half_name)
print(half_list)

# #4)
name = input("შეიყვანეთ თქვენი სახელი: ")
if name[0] == "რ":
    print("Hello")
else:
    print("Bye")