# 0) ჩამოწერეთ და ახსენით ყველა დღეს ნასწავლი ლისტის ფუნქცია

# 1) ჩამოწერეთ და ახსენით ყველა დღეს ნასწავლი სტრინგის ფუნქცია

# 2) მომხმარებელს შემოატანინეთ თავისი სახელი და გვარი(ერთ ინფუთში) და დააბრუნეთ ისე რომ
# სახელიც და გვარიც დიდი ასოთი იწყებოდეს

# 3) შექმენით რიცხვების სია, შემდეგ შექმენით ახალი ცვლადი და მასში შეინახეთ ამ სიის დიაპაროზი
# (დიაპაზონი არის უდიდესს გამოკლებული უმცირესი)

# Hard level
# 4)მომხმარებელს შემოატანინეთ სახელი. თუ ეს სახელი უკვე დიდი ასოთი იწყება,
# მაშინ მთლიანი სახელი გადააქციეთ დიდ ასოებად და დაპრინტეთ, ხოლო თუ პირველი ასო არ არის დიდი,
# მაშინ გახადეთ იგი დიდი ასო და დააბრუნეთ



#0)
# max()
# min()
# .copy()
# sorted()
# sum()

#1)
# .upper() - ეს ფუნქცია სტრინგში არსებულ ყველა პატარა ასოს გადააქცევს დიდ ასოებად
# .lower() - ეს ფუნქცია სტრინგში არსებულ ყველა დიდ ასოს გადააქცევს პატარა ასოებად
# .find() - ეს ფუნქციის საშუალებით შეგვიძლია გავიგოთ კონკრეტული სიმბოლოს ან სიმბოლოების ინდექსი სტრინგში
# .count() - ამ ფუნქციის საშუალებით შეგვიძლია გავიგოთ რამდენჯერ მეორდება კონკრეტული სიმბოლო ან სიმბოლოები სტრინგში
# .title() - ამ ფუნქციის საშუალებით შეგვიძლია სტრინგში თითოეული სიტყვის პირველი ასო გავხადოთ დიდი
# .capitalize() - ამ ფუნქციის საშუალებით შეგვიძლია სტრინგის პირველი ასო გავხადოთ დიდი
# .replace() - ამ ფუნქციის საშუალებით შეგვიძლია სტრინგში არსებული კონკრეტული სიმბოლო ან სიმბოლოები ჩავანაცვლოთ სხვა სიმბოლოებით
# .swapcase() - ამ ფუნქციის საშუალებით შეგვიძლია სტრინგში არსებული დიდი ასოები გადავაქციოთ პატარა ასოებად და პირიქით, პატარა ასოები დიდებად

#2)
fullname = input("Enter your full name: ")
title_fullname = fullname.title()
print("Your Full Name:", title_fullname)

#3)
nums = [3,5,78,2,11,56,21,9,4,6]
max = max(nums)
min = min(nums)
range = float(max) - float(min)
print("Max - Min =", range)

#4)
name = input("Enter your name: ")
if name[0] == name[0].upper():
    print(name.upper())
elif name[0] != name[0].upper():
    print(name.capitalize())