# 0)კომენტარების დახმარებით დაწვრილებით ახსენით დღეს ნასწავლი ლისტის ფუნქციები
# 1)შექმენით სია, შემდეგ ამ სიის პირველი ელემენტი ჩაამატეთ ბოლოში. ხოლო საბოლოოდ დაგრჩებათ რომ გაქვთ 2 ერთნაირი ელემენტი, ამის გამო ამოშალეთ პირველი ელემენტი
# 2)ჩვენ გვჭირდება რომ გამოვიყენოთ იგივე სიის სახელი რაც გამოვიყენეთ წინა სავარჯიშოში, ამიტომაც წინა სავარჯიშოს სია მთლიანად გავწმინდოთ, შემდეგ ჩაამატეთ 2 ელემენტი და საბოლოოდ ამ 2 ელემენტს შორის კიდევ 1 ელემენტი
# 3)შექმენით რიცხვების სია.
# თუ ამ სიაში რიცხვი 10 არის მეხუთე ინდექსზე მაშინ ამ სიის ბოლო ელემენტი ამოშალეთ
# ხოლო თუ ამ სიაში რიცხვი 10 არ არის მეხუთე ინდექსზე მაშინ ამ სიის მეხუთე ენდექსზე ჩაამატეთ რიცხვი 10
# 4)შექმენით სია და თქვენი იდეებით ეცადეთ რომ გამოიტენოთ ყველა ნასწავლი სიის ფუნქცია(სულ 9 ცალი გვაქვს ნასწავლი)





#0)
# .sort() - საშუალებას გვაძლევს ლისტის ელემენტების დალაგებას ზრდადობის ან კლებადობის მიხედვით(რიცხვების შემთხვევაში),
# ტექსტების შემთხვევაში კი დაიწყება A,B,C... ანუ ზრდადობით ალაგებს ელემენტებს

# .clear() - ამ ფუნქციის საშუალებით შეგვიძლია ლისტის ყველა ელემენტის წაშლა

# .reverse() - საშუალებას გვაძლევს შემოვაბრუნოთ ლისტის ელემენტები

# .index() - ამ ფუნქციის საშუალებით შეგვიძლია გავიგოთ კონკრეტული ელემენტის ინდექსი ლისტში

# .insert() - ამ ფუნქციის საშუალებით შეგვიძლია ლისტში კონკრეტულ ინდექსზე ჩავამატოთ ელემენტი

# .remove() - ამ ფუნქციის საშუალებით შეგვიძლია სიიდან ამოვიღოთ კონკრეტული ელემენტი, რომელსაც "()" ფრჩხილებში მივუთითებთ




#1)
list = [1, 2, 3, 4, 5, 6, 7, 8,]
first = list[0]
f = len(list)
list.insert(f, first)
list.pop(0)
print(list)


#2)
list.clear()
list.append(2)
list.append(4)
list.insert(1, 3)
print(list)


#3)
nums = [2, 5, 6, 8, 4, 1, 3, 9, 10, 12, 15, 18, 20]
if nums[5] == 10:
    nums.pop()
elif nums[5] != 10:
    nums.insert(5, 10)
print(nums)








#4)

#ნასწავლი ფუნქციები
#1. append()
#2. pop()
#3. len()
#4 .sort()
#5 .clear()
#6 .reverse()
#7 .index()
#8 .insert()
#9 .remove()



list = [3,2,1,11,5,4,7,8,9,22,16,12,13,14,15,6,17,18,19,20,21,10]

list.append(23)
list.append(24)
print(list)

list.pop()
list.pop(17)
print(list)

l = len(list)
print(l)

list.sort()
print(list)

list.clear()
list.insert(0, 32)
list.insert(1, 19)
list.insert(2, 22)
print(list)

list.reverse()
print(list)

print(list.index(22))

list.append(66)
list.remove(66)

print(list)