# 0) კომენტარებით ახსენით რა არის steppingი
# 1) შექმენით სია სადაც შეინახავთ თქვენი მოგებრობეის სახელებს, შემდეეგ slicingის და stepინგის დახმარებით გამოიტანეთ ყოველი მეორე წევრი

#0) stepping გამოიყენება სლაისინგის დროს, ამ დროს შეგვიძლია განვსაზღვროთ რამდენი ელემენტის გამოტოვება გვინდა სლაისინგში და რაღაც ინტერვალით
# შეგვიძლია გამოვიტანოთ. მაგ. თუ გვსურს list-ში ყოველი მეორე ელემენტის მიღება, შეგვიძლია გამოვიყენოთ '::2'

#1)
friends = ["Gega", "Nika", "Giorgi", "Leqso", "Datuna", "Toko", "Daviti"]
step = friends[::2]
print(step)