# 2) კომენტარებით ახსენით, რა არის ფუნქცია და რა დადებითი მხარე აქვს მას
# 3) გამოიყენეთ ყველა ნასწავლი listის ფუნქცია

#2) ფუნქცია არის კოდის ბლოკი, რომელსაც აქვს რაღაც გარკვეული სახელი და და შეგვიძლია გამოვიძახოთ ნებისმიერ დროს.
# ფუნქციები საშუალებას გვაძლევს გავიმეოროთ კოდი, ასევე კოდის წაკითხვის უნარი გავზარდოთ და ნაკლები შეცდომა დავუშვათ.

#3)
my_list = [1, 2, 3, 4, 5]

# append() - ამატებს გადაცემულ ელემენტს სიის ბოლოს
my_list.append(6)
print(my_list)

# pop() - შლის გადაცემულ ინდექსზე არსებულ ელემენტს
my_list.pop(2)
print(my_list)

# len() - გამოიტანს გადაცემული ელემენტის სიგრძეს, ზომას
length = len(my_list)
print(length)