// # Homework

// 1) კომენტარებით ახსენით რას ნიშნავს სინქრონულობა და ასნიქრონულობა

// 2) შექმენით პროგრამა, რომელიც კონსოლში თანმიმდევრულად დაბეჭდის სამ სიტყვას ("პირველი", "მეორე", "მესამე"), მაგრამ არა ერთდროულად:
// "პირველი" უნდა დაიბეჭდოს მაშინვე (სინქრონულად).
// "მეორე" უნდა დაიბეჭდოს 2 წამის დაგვიანებით (setTimeout).
// "მესამე" უნდა დაიბეჭდოს 1 წამის დაგვიანებით (setTimeout).

// 3) შექმენით ახალი Promise სახელად checkEvenNumber, რომელიც ამოწმებს რაიმე ფიქსირებულ რიცხვს (მაგალითად, 4-ს).
// თუ რიცხვი ლუწია, პრომისი წარმატებით უნდა დასრულდეს (resolve) და ტექსტად დააბრუნოს: "რიცხვი ლუწია".
// თუ რიცხვი კენტია, პრომისი უნდა დაირღვეს (reject) და ტექსტად დააბრუნოს: "რიცხვი კენტია".

// 4) დაასრულეთ საკლასო დავალება

// 5) გადახედეთ ჩანაწერს








// 1)
// სინქრონულობა ნიშნავს, რომ კოდი შესრულდება თანმიმდევრულად, ერთი ოპერაცია დასრულდება შემდეგი ოპერაციის დაწყებამდე
// ასინქრონულობა კი ნიშნავს, რომ კოდი შეიძლება შესრულდეს პარალელურად, ანუ ერთი ოპერაცია შეიძლება დაიწყოს და დასრულდეს სხვა ოპერაციის დასრულების გარეშე
// ეს გვაძლევს საშუალებას რომ  პროგრამამ უფრო სწრაფად და ეფექტურად იმუშაოს



// 2)
console.log("პირველი");
setTimeout(() => {
    console.log("მეორე");
}, 2000);
setTimeout(() => {
    console.log("მესამე");
}, 1000);



// 3)
const checkEvenNumber = new Promise((resolve, reject) => {
    const number = 4
    if (number % 2 === 0) {
        resolve("რიცხვი ლუწია");
    } else {
        reject("რიცხვი კენტია");
    }
})

checkEvenNumber
    .then(message => console.log(message))
.catch(error => console.log(error));



// 4)
// დასრულებული მქონდა ✅


