// 1) ახსენით რა არის: Client, Server, HTTP, TCP, სტატუს კოდი 200 და 404, რა განსხვავებაა HTTP-სა და HTTPS-ს შორის? ასევე ახსენით რა არის GET და POST


// Client - სერვერს უგზავნის მოთხოვნას

// Server - ამ მოთხოვნას იღებს და პასუხს აბრუნებს

// HTTP - ეს კი არის პროტოკოლი რომელიც განსაზღვრავს თუ როგორ უნდა გადაეცეს მონაცემები ინტერნეტში

// TCP - უზრუნველყოფს მონაცემების სწორად და უსაფრთხოდ გადაცემას

// სტატუს კოდი 200 - „OK“ — მოთხოვნა შესრულდა წარმატებით

// სტატუს კოდი 404 - „Not Found“ — გვერდი ან რესურსი ვერ მოიძებნა/წაშლილია

// HTTP და HTTPS ს შორის განსხვავება: HTTPS-ში მონაცემები დაშიფრულია, ეს კი უსაფრთხოებას ზრდის, ხოლო HTTP-ში დაშიფვრა არ გამოიყენება.

// GET - გამოიყენება მონაცემების მოთხოვნისთვის (მაგალითად გვერდის ჩატვირთვა)

// POST - გამოიყენება მონაცემების სერვერზე გაგზავნისთვის (ეს შეიძლება იყოს ფორმის შევსება და მისი გაგზავნა)