# 0)ჩამოწერეთ რომელი მონაცემთა ტიპებია mutable და immutable
# 1)შექმენით 2 სია. ერთში შეინახეთ ოჯახის წევრების სახელები, მეორეში კი მათი ასაკები და შემდგომ გამოპრინტეთ ორივე სია
# 2)შექმენით სია fruits, სადაც შეინახავ რამოდენიმე ხილს და შემდეგ ტერმინალში გამოიტანე ასეთი წინადადება: I love apple. მაგრამ ის ხილი რომელიც თქვენ გიყვართ(გამოიყენეთ ინდექსინგი)
# 3)შექმენით სია იმაზე რაზეც გინდათ, შემდეგ კი ინდექსინგის მეშვეობით გამოიტანეთ მხოლოდ კენტ ელემენტზე მდგომი რიცხვები
# 4)შექმენით სია ["Goa", "at", "I", "study"], შემდეგ კი ინდექსინგის მეშვეობით ეს წინადადება გამოიტანეთ სწორად



# 0)
#immutable მონაცემთა ტიპის შეცვლა შეუძლებელია, ესენია string, integer, boolean, float.
#mutable მონაცემთა ტიპის შეცვლა კი შესაძლებელია, ასეთია list-ი.

#1)
family_members = ["დედა", "ძმა", "ბებია", "ბიძა"]
family_ages = [39, 11, 65, 38]

print(family_members)
print(family_ages)

#2)
fruits = ["apple", "bannana", "orange", "mango"]
print("i love " + fruits[0] + "!")

#3)
numbers = [10, 22, 34, 45, 56, 77, 78]
print(numbers[1], numbers[3], numbers[5])

#4)
GOA = ["GOA", "at", "I", "study"]
print(GOA[2], GOA[3], GOA[1], GOA[0], "!")