# 0)კომენტარებით ახსენით რას აკეთებს if; elif; else
# 1)კომენტარებით ახსენით რას განსხვავებაა if-else და if-elif-else შორის
# 2)კომენტარებით ახსენით რას შვება Break


#0)
# if - ამოწმებს რაღაც გარკვეულ პირობას და თუ პირობა მართალია, ასრულებს მის ქვეშ არსებულ კოდს.
# elif - (else if) გამოიყენება დამატებითი პირობის შესამოწმებლად, თუ წინა if ან elif არ შესრულდა.
# else - ასრულებს კოდს, თუ არცერთი if-ის ან elif-ის პირობა არ შესრულდა.

#1)
# if-else - მხოლოდ ორ ვარიანტს ამოწმებს: ერთი პირობა (if) და ყველა სხვა შემთხვევა (else).
# if-elif-else - საშუალებას გაძლევს შეამოწმო რამდენიმე სხვადასხვა პირობა (elif-ებით) და ბოლოს ყველა სხვა შემთხვევა (else).

#2)
# break გამოიყენება for ან while ციკლში, რათა ციკლი დაუყოვნებლივ შეწყდეს და გაგრძელდეს კოდის შესრულება ციკლის გარეთაც.