// 1) ახსენით რა არის: Client, Server, HTTP, TCP, სტატუს კოდი 200 და 404, რა განსხვავებაა HTTP-სა და HTTPS-ს შორის?

// 2) ნასწავლი მასალოთ ააგეთ საიტი თქვენს თავზე

// 3) CodeCademy: https://www.codecademy.com/courses/learn-intermediate-javascript/articles/http-requests წაიკითეთ ბოლომდე 




// 1)

// Client - მოწყობილობა ან პროგრამა (მაგ ბრაუზერი), რომელიც სერვერს უგზავნის მოთხოვნას

// Server - კომპიუტერი ან პროგრამა, რომელიც ამ მოთხოვნას იღებს და პასუხს აბრუნებს

// HTTP(hypertext transfer protocol) - განსაზღვრავს როგორ უნდა გადაეცეს მონაცემები ინტერნეტში (შესაძლოა იყოს ტექსტი, სურათი).

// TCP - არის ერთგვარი "გზა" და უზრუნველყოფს მონაცემების უსაფრთხო და თანმიმდევრულ გადაცემას ქსელში

// სტატუს კოდი 200 - ნიშნავს რომ მოთხოვნა წარმატებით შესრულდა.

// სტატუს კოდი 404(„Not Found“) → ნიშნავს იმას რომ მოთხოვნილი გვერდი ან რესურსი ვერ მოიძებნა, ან ფაილი აღარ არსებობს

// HTTP და HTTPS(HTTP Secure)-ს შორის განსხვავება ისაა, რომ HTTPS-ში მონაცემები დაშიფრულია და უფრო უსაფრთხოა, ხოლო HTTP-ში დაშიფვრა არ გამოიყენება




