// 1) ახსენით რას შვება Promise.all() რა პლიუსები აქვს მას და რა მინუსები ასევე დაწერეთ 1 მაგალითი მასზე



//1

// Promise.all() - მეთოდია, ის იღებს Promise-ების მასივს და აბრუნებს ახალ promiseს
// ეს ახალი promise კი resolveდება როცა ყველა წარმატებით დასრულდება
// ან reject-დება მაშინვე, როცა რომელიმე Promise შეცდომას გამოიწვევს(მისი ცუდი თვისება ესაა)

// კარგი ისაა რო რამდენიმე ასინქრონული ოპერაცია სრულდება ერთდროულად და შედეგი ერთ მასივში მოდის,
// ასევე აღარ გვჭირდება თითოეული Promise-ის ცალცალკე დამუშავება

// ძალიან ცუდი მინუსი ის აქვს რომ თუ ერთერთი Promise შეცდომას გამოიწვევს, 
// მთლიანი Promise.all() reject-დება.


const t1 = new Promise((resolve) => setTimeout(() => resolve("პირველი დასრულდა"), 1000));
const t2 = new Promise((resolve) => setTimeout(() => resolve("მეორე დასრულდა"), 2000));
const t3 = new Promise((resolve) => setTimeout(() => resolve("მესამე დასრულდა"), 1500));

Promise.all([t1, t2, t3])
    .then((resultebi) => {
        console.log("ყველა task შესრულებულია:", resultebi);
    })
    .catch((erori) => {
        console.log("error:", erori.message);
});



// 2) ახსენიოთ რაში გვეხამრება HTTP Request ები


// HTTP Request - მოთხოვნა რომლითაც ჩვენი ბრაუზერი ან პროგრამა სერვერს ინფორმაციას თხოვს ან პირიქით, ინფორმაციას აძლევს ამ სერვერს
// მაგ, რეგისტრაციისას ჩვენი სახელი და პაროლი Request-ით მიდის სერვერზე






// 3) ახსენით რა არის: Client,  Server, HTTP, TCP, სტატუს კოდი 200 და 404, რა განსხვავებაა HTTP-სა და HTTPS-ს შორის?



// Client - მოწყობილობა ან პროგრამა (მაგ ბრაუზერი), რომელიც სერვერს უგზავნის მოთხოვნას

// Server - კომპიუტერი ან პროგრამა, რომელიც ამ მოთხოვნას იღებს და პასუხს აბრუნებს

// HTTP(hypertext transfer protocol) - განსაზღვრავს როგორ უნდა გადაეცეს მონაცემები ინტერნეტში (შესაძლოა იყოს ტექსტი, სურათი).

// TCP - არის ერთგვარი "გზა" და უზრუნველყოფს მონაცემების უსაფრთხო და თანმიმდევრულ გადაცემას ქსელში

// სტატუს კოდი 200 - ნიშნავს რომ მოთხოვნა წარმატებით შესრულდა.

// სტატუს კოდი 404(„Not Found“) → ნიშნავს იმას რომ მოთხოვნილი გვერდი ან რესურსი ვერ მოიძებნა, ან ფაილი აღარ არსებობს

// HTTP და HTTPS(HTTP Secure)-ს შორის განსხვავება ისაა, რომ HTTPS-ში მონაცემები დაშიფრულია და უფრო უსაფრთხოა, ხოლო HTTP-ში დაშიფვრა არ გამოიყენება


