// 0)რა არის React?

// 1)რისთვის გამოიყენება React?

// 2)რა არის კომპონენტი React-ში?

// 3)რა არის JSX?

// 4)რა განსხვავებაა ჩვეულებრივ HTML-სა და React-ში დაწერილ JSX-ს შორის?


// 0) React - JavaScript ბიბლიოთეკა. გამოიყენება ვებ-აპლიკაციების UI-ს (ინტერფეისის) შესაქმნელად.

// 1) მარტივად ქმნის და მართავს დინამიურ, სწრაფ და მოქნილ ვებსაიტებს.

// 2) პატარა „ბლოკი“ (ფუნქცია ან კლასი), რომელიც UI-ს კონკრეტულ ნაწილს აღწერს (მაგ. ღილაკი, ფორმა).

// 3) JSX - სინტაქსი, რომელიც HTML-ს ჰგავს, მაგრამ JavaScript-ში გამოიყენება UI-ს აღწერისთვის.

// 4) განსხვავება HTML-სა და JSX-ს შორის - HTML არის ჩვეულებრივი მარკაპი, მხოლოდ სტრუქტურას ქმნის, ხოლო JSX-ში შეგვიძლია პირდაპირ ჩავსვათ 
// JavaScriptის კოდი {} ფიგურულ ფრჩხილებში და გამოვიყენოთ React-ის ლოგიკა. მაგალითად, შეგვიძლია გამოვიყენოთ ცვლადები, ფუნქციები, ლუპები
// და სხვა JavaScript-ის ელემენტები JSX-ში.

