// 1)მოიძიეთ დეტალური ინფორმაცია და ახსენით რა არის მოდული და რაში არის საჭირო,როდის ვიყენებთ
// 2)დააინსტალირეთ node და სცადეთ თქვენი კოდის გაშვება node ის დახმარებით
// დავალება 3: "მათემატიკური დამხმარე"შექმენი კლასი MathHelper, რომელსაც ექნება შემდეგი სტატიკური მეთოდები:

// 1)isEven(number): აბრუნებს true-ს თუ რიცხვი ლუწია, სხვა შემთხვევაში — false.

// 2)average(numbers): იღებს რიცხვების მასივს და აბრუნებს მათ საშუალო არითმეტიკულს.

// მოთხოვნა: კოდში არ გამოიყენო new MathHelper(). მეთოდებს მიმართე პირდაპირ კლასიდან.


// 1)
// მოდული —  ფაილში კოდის ნაწილი, რომელიც შეიცავს ფუნქციებს, კლასებს ან ცვლადებს
// და შეიძლება გამოვიყენოთ სხვა ფაილებშიც.

// ის გვჭირდება რადგან კოდი დავყოთ და მარტივად გასაგები და მოსახერხებელი იყოს

// ვიყენებთ როცა გვინდა დიდი პროგრამა დავყოთ პატარა ნაწილებად
// როცა გვჭირდება ერთი და იგივე ფუნქციების გამოყენება სხვადასხვა ფაილში.




class MathHelper {
    static isEven(number) {
        return number % 2 === 0;
    }

    static average(numbers) {
        const sum = numbers.reduce((acc, n) => acc + n, 0);
        return sum / numbers.length;
    }
}

console.log(MathHelper.isEven(22))
console.log(MathHelper.isEven(11))
console.log(MathHelper.average([11, 22, 33]))

