// 1)შექმენი სია სადაც შეინახავთ ნებისმიერ მონაცემთა ტიპის ელემენტს, შენი დავალებაა ამოიღო სიიდან ერთი 
// რანმომული ელემენტი და გამოიტანო კონსოლში, მინიშნება: Math.random()


// დავალება 2: ცვლადების შექმნა (let და const)
// ეს დავალება დაგეხმარება გაიგო სხვაობა let და const ცვლადებს შორის.

// შექმენი ცვლადი let-ის გამოყენებით შენი ასაკისთვის (მაგ: myAge) და მიანიჭე შესაბამისი რიცხვითი მნიშვნელობა.

// შექმენი ცვლადი const-ის გამოყენებით შენი დაბადების წლისთვის (მაგ: birthYear) და მიანიჭე მნიშვნელობა.

// ახლა სცადე შეცვალო myAge-ის მნიშვნელობა ახალი რიცხვით.

// გამოიტანე ორივე ცვლადი console.log()-ის დახმარებით.

// ექსპერიმენტი: სცადე კოდში შეცვალო birthYear-ის მნიშვნელობაც. დააკვირდი რა შეცდომას (Error) გამოიტანს კონსოლი, რათა დარწმუნდე, რომ const-ის (მუდმივას) გადაწერა არ შეიძლება.



// დავალება 2: მათემატიკური მინიჭების ოპერატორები.
// გამოიყენე მოკლე ჩანაწერები (+=, -=, *=, /=).

// წარმოიდგინე, რომ გაქვს საბანკო ანგარიში. შექმენი ცვლადი let balance = 100;

// ანგარიშზე ჩაგირიცხეს 50 ლარი. გაზარდე ბალანსი += ოპერატორის გამოყენებით.

// მაღაზიაში დახარჯე 30 ლარი. შეამცირე ბალანსი -= ოპერატორის გამოყენებით.

// შენი დარჩენილი ბალანსი გაორმაგდა (ბონუსი). გამოიყენე *= ოპერატორი.

// დაბეჭდე საბოლოო balance კონსოლში.



// დავალება 3: ინკრემენტი და დეკრემენტი
// გავარჯიშდი ++ და -- ოპერატორებზე.

// შექმენი ცვლადი ვიდეოს "ლაიქებისთვის": let likes = 15;

// ვიღაცამ მოიწონა ვიდეო. გაზარდე likes ზუსტად 1-ით ინკრემენტის (++) გამოყენებით.

// ვიღაცამ წაშალა თავისი ლაიქი. შეამცირე likes 1-ით დეკრემენტის (--) გამოყენებით.

// გამოიტანე შედეგი კონსოლში ყოველი მოქმედების შემდეგ.


// დავალება 4: სტრიქონების შეერთება და ინტერპოლაცია.
// ისწავლე ტექსტისა და ცვლადების ერთმანეთთან დაკავშირება ორი სხვადასხვა მეთოდით.

// შექმენი 3 ცვლადი: firstName (შენი სახელი), lastName (შენი გვარი) და city (შენი ქალაქი).

// Concatenation (+ ნიშნით): შექმენი ახალი ცვლადი greeting1 და დააკავშირე ეს ცვლადები ისე, რომ მიიღო წინადადება: "გამარჯობა, მე ვარ [სახელი] [გვარი] და ვცხოვრობ ქალაქ [ქალაქი]-ში." (არ დაგავიწყდეს სივრცეების (space) დამატება ბრჭყალებში).

// Interpolation (უკუკვოტებით `` და ${}): შექმენი ახალი ცვლადი greeting2 და ზუსტად იგივე წინადადება ააწყვე Template Literals-ის გამოყენებით.

// დაბეჭდე ორივე კონსოლში და დააკვირდი, რომელი სინტაქსი უფრო მოსახერხებელი და სუფთაა.



// 1)
const list1 = ["gamarjoba", 66, false, "sityva", 68.99];
const randomIndex = Math.floor(Math.random() * list1.length);
console.log(list1[randomIndex]);

// 2)
let myAge = 25;
const birthYear = 2011;
myAge = 26;
console.log(myAge);
// birthYear = 2011; error-ს გამოიტანს, რადგან const ცვლადის შეცვლა შეუძლებელია
console.log(birthYear);

// 3)
let balance = 100;
balance += 50;
balance -= 30;
balance *= 2;
console.log(balance);

// 4)
likes = 15;
console.log(likes);
likes++;
console.log(likes);
likes--;
console.log(likes);

// 5)
let firstName = "Vaja";
let lastName = "Jamaspishvili";
let city = "Tbilisi";
const greeting1 = "გამარჯობა, მე ვარ " + firstName + " " + lastName + " და ვცხოვრობ ქალაქ " + city + "-ში.";
const greeting2 = `გამარჯობა, მე ვარ ${firstName} ${lastName} და ვცხოვრობ ქალაქ ${city}-ში.`;
console.log(greeting1);
console.log(greeting2);

