# 0) რა არის ფუნქცია?

# 1) ახსენით როგორ შეგვიძლია შევქმნათ ფუნქციები

# 2) ახსენით რა არის არგუმენტი?

# 3) შექმენით ფუნქცია რომელსაც აქვს 2 არგუმენტი num1 და num2,
# თუ პირველი რიცხვი მეორეზე იყოფა უნაშთოდ მაშინ დააბრუნეთ მათი ნამრავლი,
# ხოლო თუ ნაშთი რჩება მაშინ მათი ჯამი 

# 4) შექმენით ფუნქცია რომელსაც გადაეცემა 2 არგუმენტი width და height,
# ეს არგუმენტები არის ოთკუთხედის გვერდები, თუ ეს ოთხკუთხედი არის კვადრატი მაშინ დააბრუნე მისი ფართობი,
# ხოლო თუ არის მართკუთხედი მაშინ დააბრუნე პერიმეტრი





# 0)
# ფუნქცია არის კოდის ბლოკი და შეგვიძლია მისი უსასრულოდ გამოყენება, როდესაც ერთი და იმავე კოდის გამეორება გვინდა.
# ფუნქციების გამოყენებისას შედარებით ნაკლები შანსია იმისა, რომ შეცდომა დავუშვათ


# 1)
# ფუნქციის შექმნა ხდება "def" keyword-ით, შემდეგ ვწერთ ფუნქციის სახელს და შემდეგ ფრჩხილებში ვწერთ არგუმენტებს (თუ ამ ფუნქციას აქვს არგუმენტები)
# შემდეგ ვწერთ ორ წერტილს და ახალ ხაზზე ვწერთ იმ მოქმედებებს, რომელიც უნდა შესრულდეს ფუნქციის გამოძახებისას


# 2)
# არგუმენტი არის მნიშვნელობა, რომელიც გადაეცემა ფუნქციას მისი გამოძახებისას,
# რათა ფუნქციამ იმუშაოს ამ გადაცემულ არგუმენტებთან
# და იწერება ფუნქციის სახელის შემდეგ, ფრჩხილებში.


# 3)
def calculate(num1, num2):
    if num1 % num2 == 0:
        return num1 * num2
    else:
        return num1 + num2
print(calculate(16, 2))


# 4)
def rectangle_properties(width, height):
    if width == height:
        return "Area of Square:", width * height
    else:
        return "Perimeter of Rectangle:", 2 * (width + height)
print(rectangle_properties(4, 4))
print(rectangle_properties(8, 10))