// 2) ახსენით რა არის silent bug ი. ასვევე ჩამოთვალეთ ნასწავლი Erorr ები და რას ნიშნავს თითეული ახსენით

// silent bug - ანუ შეცდომა რომელიც არ იწვევს პროგრამის გაჩერებას ან შეცდომის შეტყობინების გამოჩენას, მაგრამ პროგრამა არ მუშაობს როგორც უნდა მუშაობდეს, ეს კი ლოგიკური შეცდომაა, მაგ. გვინდა რიცხვის გამრავლება მაგრამ ჩვენ ჯამი გამოგვაქვს, ანუ პროგრამა არ აჩვენებს შეცდომას მაგრამ შედეგი არასწორია


// syntax error - სინტაქსური შეცდომა, როცა კოდის სტრუქტურა არასწორია, მაგ. აკლია ორი წერტილი ან დამხურავი ფრჩხილი

// type error - როცა ვცდილობთ შევასრულოთ ოპერაცია ისეთ მონაცემთა ტიპზე, რომელსაც ეს მოქმედება არ შეუძლია

// reference error - როცა ცვლადი ან ფუნქცია არ არის შექმნილი, მაგ. ვცდილობთ გამოვიყენოთ ცვლადი რომელიც არც კი შეგვიქმნია


