// # Homework

// 1) შექმენი სამი ცვლადი:

// balance (ამჟამინდელი ბალანსი, მაგ: 500)

// withdrawAmount (რამდენის გატანა სურს, მაგ: 600)

// isAccountActive (ბულიონი - აქტიურია თუ არა ბარათი, მაგ: true)

// ქეისი 1: თუ ანგარიში არააქტიურია (!isAccountActive) -> გამოიტანე: "ტრანზაქცია უარყოფილია: ბარათი დაბლოკილია."

// ქეისი 2: თუ გასატანი თანხა მეტია ბალანსზე -> გამოიტანე: "არასაკმარისი ნაშთი."

// ქეისი 3: თუ გასატანი თანხა ნაკლებია ან ტოლია 0-ზე -> გამოიტანე: "გთხოვთ, მიუთითოთ ვალიდური თანხა."

// ქეისი 4: თუ გასატანი თანხა ზუსტად ბალანსის ტოლია -> გამოიტანე: "ტრანზაქცია სრულდება. თქვენი ბალანსი ნულდება!"

// Default: ყველა სხვა შემთხვევაში (ანუ როცა თანხა საკმარისია და ბარათიც მუშაობს) -> გამოიტანე: "ტრანზაქცია წარმატებულია.".

// 2) შექმენი Helper ფუნქცია isAllowed, რომელიც პარამეტრად მიიღებს ასაკს (age).

// ფუნქციის შიგნით გამოიყენე if/else:

// თუ ასაკი არის 18 ან მეტი, ფუნქციამ უნდა დააბრუნოს ტექსტი: "წვდომა დაშვებულია".

// თუ ნაკლებია, უნდა დააბრუნოს: "წვდომა აკრძალულია".

// შემდეგ შექმენი მასივი (ან უბრალოდ 3 ცვლადი) სხვადასხვა ასაკით (მაგ: 15, 20, 18).

// თითოეულისთვის გამოიძახე isAllowed და დაბეჭდე პასუხი.

// 3) დაასრულეთ საკლასო დავალება ვისაც არ დაგისრულებიათ


// პასუხები:

// 1)
let balance = 24400;
let withdrawAmount = 100000;
let isAccountActive = true;
switch (true) {
    case !isAccountActive:
        console.log("ტრანზაქცია უარყოფილია: ბარათი დაბლოკილია.");
        break;
    case withdrawAmount > balance:
        console.log("არასაკმარისი ნაშთი.");
        break;
    case withdrawAmount <= 0:
        console.log("გთხოვთ, მიუთითოთ ვალიდური თანხა.");
        break;
    case withdrawAmount === balance:
        console.log("ტრანზაქცია სრულდება. თქვენი ბალანსი ნულდება!");
        break;
    default:
        console.log("ტრანზაქცია წარმატებულია.");
}

// 2)
function isAllowed(age) {
    if (age >= 18) {
        return "წვდომა დაშვებულია";
    } else {
        return "წვდომა აკრძალულია";
    }
}

// let age1 = 15;
// let age2 = 20;
// let age3 = 18;
// console.log(isAllowed(age1));
// console.log(isAllowed(age2));
// console.log(isAllowed(age3));

let ages = [15, 20, 18];

for (let age of ages) {
    console.log(isAllowed(age));
}

