# 0) კომენტარებით ახსენით, რა არის ფუნქციები და რატომ ვიყენებთ მათ
# 1) შექმენით ფუნქცია სახელად "Printer", რომელიც გამოიტანს თქვენს სასურველ ტექსტს 3ჯერ. გამოიძახეთ ეს ფუნქცია 5ჯერ


#0)
# ფუნქცია არის კოდის ბლოკი, რომელსაც აქვს სახელი და შეგვიძლია მისი უსასრულოდ გამოყენება, როდესაც გვინდა რომ იგივე კოდი გავიმეოროთ

# ფუნქციების გამოყენებით ჩვენ ვზოგავთ დროს და შედარებით ნაკლები შანსია რომ შეცდომა დავუშვათ


#1)
def Printer():
    print("My Text")
    print("My Text")
    print("My Text")
    
for i in range(5):
    Printer()