# 0) ახსენით რა არის tuple

# 1) გააკეთეთ tuple სახელად names, შეინახეთ მასში სახელები, შემდეგ კი დაპრინტეთ ბოლოს წინა სახელი

# 2) შექმენით tuple სადაც შეინახავთ მომხმარებლის სახელს, გვარს და ასაკს. შემდეგ კი შეინახეთ თითოეული name,
# lastname და age ცვლადში და დაპრინტეთ

# 3) შექმენით tuple სადაც შეინახავთ აკადემიის სახელს, ჯგუფის სახელს, და სიას სადაც იქნება თქვენი ჯგუფელების სახელები,
# შეინახეთ ისინი ცალკე ცვლადებში და დაპრინტეთ

# 4) შექმენით ფუნქცია სახელად manual_min რომელსაც გადაეცემა რიცხვების სია და უნდა დააბრუნოს ამ სიიდან ყველაზე პატარა



#0)Tuple არის immutable მონაცემთა ტიპი რომელიც გამოიყენება ელემენტის/ელემენტების შენახვისთვის
# Tupleში მნიშვნელობების შეცვლა არ შეგვიძლია მისი შექმნის შემდეგ. Tupleები იწერება მრგვალი ფრჩხილებით() და ელემენტები ერთმანეთისგან მძიმეთი უნდა გამოვყოთ(,)
# tupleები მაშინ გამოიყენება როცა გვინდა რომ მონაცემები არ შეიცვალოს პროგრამის მუშაობისას


#1)
names = ("Vaja","Nika","Saba", "Gio","Tornike")
print(names[-2])

#2)
user = ("Dexter","Morgan",35)
name, lastname, age = user
print(name, lastname, age)

#3)
members = [
    "ნიკოლოზ ჯაღუმიძე", "ვაჟა ჯამასპიშვილი", "ილია ქავთარაძე","ლაზარე ონიანი",
    "ლაზარე ბუბუტეიშვილი","ალექსანდრე ლინიკი","სანდრო ჩოქური", "დავით დოლიძე",
    "ალექსანდრე ფაღავა","გაგა წიკლაური","ნერსე ზარიძე","ილია გახარია"
    ]

academy = ("Goal-Oriented Academy", "Group 83", members)

academy_name, group_name, group_members = academy
print(academy_name, group_name, group_members)


#4)
def manual_min(num):
    if len(num) == 0:
        return 0
    else:
        mi = num[0]
        for i in num:
            if i < mi:
                mi = i
        return mi
test = [5.7,2,12,5,7,98,900,32,3]
print(manual_min(test))
print(min(test))
