#0)ახსენი ერთ წინადადებაში რისთვის ვიყენებთ type() ფუნქციას
#1)დაწერე კოდი, რომელიც გადააქვს "123" string ტიპიდან integer-ში და ბეჭდავს შედეგის ტიპს
#2)დაწერე კოდი, რომელიც გადააქვს რიცხვი 3.7 integer-ში და float-ში — შემდეგ დაბეჭდე ორივეს ტიპი
#3)დაწერე კოდი, რომელიც ამოწმებს არის თუ არა ცვლადი age = "25" string ტიპის, და თუ string-ია — გადააქციე integer-ად
#4)დაწერე კოდი, რომელიც ადარებს "10" და 10 — თანასწორია თუ არა
#5)დაწერე კოდი, რომელიც ამოწმებს არის თუ არა "5" უფრო დიდი ვიდრე 3 — სანამ შეადარებ, გადააქციე "5" integer-ად

print("type() ფუნქციას ვიყენებთ იმისთვის, რომ გავიგოთ რა ტიპის მონაცემი არის კონკრეტული მონაცემი.") #0


print(type(int("123"))) #1


print(type(int(3.7))) #2


print(type(float(3.7))) #3
age = "25"
print(type(age))
print(type(int(age)))
print(int(age))


print(10 == 10) #4


print(int("5") > 3) #5